Repository: DEFRA/epr-obligationchecker-frontend
Catalog: src/FrontendObligationChecker/Resources/Views/PublicRegister/Guidance.*.resx
Languages: cy

# Guidance.AccessibleFormatTextPart1
source: If you use assistive technology (such as a screen reader) and need a version of this document in a more accessible format, please email
cy: Gall defnyddwyr technoleg hygyrch ofyn am y ddogfen yma mewn fformat hygyrch. Anfonwch neges ebost at

# Guidance.AccessibleFormatTextPart2
source: Please tell us what format you need. It will help us if you say what assistive technology you use.
cy: Dywedwch:

# Guidance.BusinessAndTheEnvironmentLink
source: Business and the environment
cy: Busnes a'r amgylchedd

# Guidance.Bytes
source: Bytes
cy: Beit

# Guidance.Caption
source: Guidance
cy: Canllawiau

# Guidance.ComplianceSchemeRegisteredForRpd
source: Compliance schemes registered for the ‘report packaging data’ service
cy: Cynlluniau cydymffurfio sydd wedi'u cofrestru ar gyfer y gwasanaeth ‘rhoi gwybod am ddata pecynwaith'

# Guidance.DepartmentForEnvironmentLinkText
source: Department for Environment, Food & Rural Affairs
cy: Adran yr Amgylchedd, Bwyd a Materion Gwledig

# Guidance.Description
source: Find producers and compliance scheme operators registered for the ‘report packaging data’ service. You can also find organisations subject to enforcement actions.
cy: Lawrlwythwch restr o gynhyrchwyr sydd wedi'u cofrestru ar y gwasanaeth Rhoi Gwybod am Ddata Pecynwaith o dan y Rheoliadau Rhwymedigaethau Cynhyrchwyr (Pecynwaith a Gwastraff Pecynwaith).

# Guidance.Documents
source: Documents
cy: Dogfennau

# Guidance.EnforcementAction
source: Enforcement action
cy: Camau gorfodi

# Guidance.EnforcementActionDescription
source: Find organisations subject to enforcement action using the list below:
cy: Dod o hyd i sefydliadau sy'n destun camau gorfodi drwy ddefnyddio'r rhestr isod:

# Guidance.EnvironmentAgencyLink
source: Environment Agency
cy: Asiantaeth yr Amgylchedd

# Guidance.ExploreTheTopic
source: Explore the topic
cy: Archwilio'r pwnc

# Guidance.From
source: From:
cy: Oddi wrth:

# Guidance.Heading
source: Public register for the ‘report packaging data’ service
cy: Cofrestrau cyhoeddus pecynwaith

# Guidance.LastUpdated
source: Last updated:
cy: Y diweddariad diwethaf:

# Guidance.NaturalResourcesWalesLink
source: Natural Resources Wales
cy: Cyfoeth Naturiol Cymru

# Guidance.NorthernIrelandEnvironmentAgencyLink
source: Northen Ireland Environment
cy: Asiantaeth Amgylchedd Gogledd Iwerddon

# Guidance.PageTitle
source: Public register for the ‘report packaging data’ service
cy: Cofrestrau cyhoeddus pecynwaith

# Guidance.ProducersRegisteredForRpd
source: Producers registered for the ‘report packaging data’ service
cy: Cofrestr gyhoeddus o gynhyrchwyr {0}

# Guidance.Published
source: Published:
cy: Wedi'i gyhoeddi:

# Guidance.Published2
source: Published
cy: Wedi'i gyhoeddi

# Guidance.RequestAnAccessibleFormat
source: Request an accessible format.
cy: Gofyn am fformat hygyrch

# Guidance.ScottishEnvironmentProtectionAgencyLink
source: Scottish Environment Protection Agency
cy: Asiantaeth Diogelu Amgylchedd yr Alban

# Guidance.SeeAllUpdates
source: See all updates
cy: Gweld pob diweddariad

# Guidance.ThisFileMayNotBeSuitable
source: This file may not be suitable for users of assistive technology.
cy: Efallai na fydd y ffeil yma'n addas i ddefnyddwyr technoleg gynorthwyol.

# Guidance.FileNoAvailable
source: File not found.
cy: [Welsh]File not available.

# Guidance.FileNoAvailableTryAgainLater
source: File not available, try again later.
cy: [Welsh]File not available, try again later.
