Repository: DEFRA/epr-obligationchecker-frontend
Catalog: src/FrontendObligationChecker/Resources/Views/Accessibility/Detail.*.resx
Languages: cy

# Accessibility.Call
source: call 03459 33 55 77 (Monday to Friday, 8.30am to 5pm)
cy: ffoniwch 03459 33 55 77 (dydd Llun i ddydd Gwener, 8.30am i 5pm)

# Accessibility.ChangeColours
source: change colours, contrast levels and fonts
cy: newid lliwiau, lefelau cyferbyniad a ffontiau

# Accessibility.ComplianceStatus
source: Compliance status
cy: Statws cydymffurfio

# Accessibility.ContactingUs
source: Contacting us by phone or visiting us in person
cy: Cysylltu â ni dros y ffôn neu ymweld â ni’n bersonol

# Accessibility.ContactUs
source: contact us
cy: Cysylltu â ni

# Accessibility.DefraIsCommitted
source: Defra is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.
cy: Mae Defra wedi ymrwymo i wneud ei gwefan yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018.

# Accessibility.Email
source: email
cy: ebost

# Accessibility.EnforcementProcedure
source: Enforcement procedure
cy: Gweithdrefn orfodi

# Accessibility.EqualityAdvisorySupportService
source: contact the Equality Advisory and Support Service (EASS)
cy: gysylltu â’r Gwasanaeth Cynghori a Chymorth Cydraddoldeb (EASS)

# Accessibility.FeedbackAndContact
source: Feedback and contact information
cy: Adborth a gwybodaeth gysylltu

# Accessibility.FindOutHowTo
source: Find out how to
cy: Rhagor o wybodaeth am sut i

# Accessibility.HasAdviceOn
source: has advice on making your device easier to use if you have a disability.
cy: gyngor ar wneud eich dyfais yn haws i’w defnyddio os oes gennych anabledd.

# Accessibility.HowAccessible
source: How accessible this website is
cy: Pa mor hygyrch yw’r wefan yma

# Accessibility.IfYouAreNotHappy
source: If you’re not happy with how we respond to your complaint
cy: Os nad ydych chi’n fodlon ar y ffordd rydyn ni’n ymateb i’ch cwyn

# Accessibility.IfYouNeedInformation
source: If you need information on this website in a different format like an accessible PDF, large print, easy read, audio recording or braille:
cy: Os oes arnoch chi angen gwybodaeth ar y wefan yma mewn fformat gwahanol fel PDF hygyrch, print bras, hawdd ei ddarllen, recordiad sain neu braille:

# Accessibility.LastReviewed
source: It was last reviewed on
cy: Y tro diwethaf iddo gael ei adolygu oedd

# Accessibility.NavigateUsingKeyboard
source: navigate most of the website using just a keyboard
cy: llywio’r rhan fwyaf o’r wefan drwy ddefnyddio’r bysellfwrdd yn unig

# Accessibility.NavigateUsingReader
source: listen to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: gwrando ar y rhan fwyaf o’r wefan drwy ddefnyddio darllenydd sgrin (gan gynnwys y fersiynau diweddaraf o JAWS, NVDA a VoiceOver)

# Accessibility.NavigateUsingSpeech
source: navigate most of the website using speech recognition software
cy: llywio’r rhan fwyaf o’r wefan drwy ddefnyddio meddalwedd adnabod lleferydd

# Accessibility.OurOfficesHaveAudio
source: Our offices have audio induction loops, or if you contact us before your visit we can arrange a British Sign Language (BSL) interpreter.
cy: Mae gan ein swyddfeydd ddolenni sain, neu os byddwch yn cysylltu â ni cyn eich ymweliad gallwn drefnu cyfieithydd Iaith Arwyddion Prydain (BSL).

# Accessibility.PreparationOfThis
source: Preparation of this accessibility statement
cy: Paratoi’r datganiad hygyrchedd yma

# Accessibility.ReportingProblems
source: Reporting accessibility problems with this website
cy: Rhoi gwybod am broblemau hygyrchedd gyda’r wefan yma

# Accessibility.TechnicalInformation
source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan yma

# Accessibility.TheEqualityAndHumanRights
source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No.2) Accessibility Regulations 2018 (the ‘accessibility regulations’).
cy: Mae’r Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) yn gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018 (y ‘rheoliadau hygyrchedd’).

# Accessibility.TheTestWasCarriedOut
source: The test was carried out by the Digital Accessibility Centre to the WCAG 2.1 standard.
cy: Cafodd y prawf ei gynnal gan y Ganolfan Hygyrchedd Digidol yn ôl safon WCAG 2.1.

# Accessibility.ThisStatementWasPrepared
source: This statement was prepared on
cy: Cafodd y datganiad yma ei baratoi ar

# Accessibility.ThisWebsiteIsPartially
source: This website is partially compliant with the
cy: Mae’r wefan yma’n cydymffurfio yn rhannol â

# Accessibility.ThisWebsiteIsRun
source: This website is run by the Department for Environment, Food and Rural Affairs (Defra).
cy: Mae hyn yn cael ei redeg gan Adran yr Amgylchedd, Bwyd a Materion Gwledig (Defra).

# Accessibility.ThisWebsiteWas
source: This website was last tested on
cy: Y tro diwethaf i’r wefan yma gael ei phrofi oedd

# Accessibility.Title
source: Accessibility statement - large organisations on the ‘report packaging data’ service
cy: Datganiad Hygyrchedd - Cynhyrchwyr mawr ar y gwasanaeth ‘Rhoi gwybod am ddata pecynwaith’

# Accessibility.WebContentAccessibility
source: Web Content Accessibility Guidelines version 2.1 AA standard
cy: safon AA Canllawiau Hygyrchedd Cynnwys y We fersiwn 2.1

# Accessibility.WeKnowSomeParts
source: We know some parts of this website are not fully accessible:
cy: Rydyn ni’n gwybod nad yw rhai rhannau o’r wefan yma’n gwbl hygyrch:

# Accessibility.WeProvideAText
source: We provide a text relay service for people who are D/deaf, hearing impaired or have a speech impediment.
cy: Rydyn ni’n darparu gwasanaeth trosglwyddo testun ar gyfer pobl sy’n Fyddar neu’n fyddar, pobl sydd â nam ar eu clyw neu sydd â nam ar eu lleferydd.

# Accessibility.WereAlwaysLooking
source: We’re always looking to improve the accessibility of this website. If you find any problems not listed on this page or think we’re not meeting accessibility requirements, contact:
cy: Rydyn ni bob amser yn ceisio gwella hygyrchedd y wefan yma. Os byddwch chi’n gweld unrhyw broblemau sydd heb eu rhestru ar y tudalen yma neu’n credu ein bod ni heb fodloni gofynion hygyrchedd, cysylltwch â:

# Accessibility.WeveAlsoMade
source: We’ve also made the website text as simple as possible to understand.
cy: Rydyn ni hefyd wedi gwneud testun y wefan mor syml â phosibl i’w ddeall.

# Accessibility.WeWantAsMany
source: We want as many people as possible to be able to use this website. For example, that means that you should be able to:
cy: Rydyn ni am i gynifer o bobl â phosibl allu defnyddio’r wefan yma. Er enghraifft, mae hyn yn golygu y dylech chi allu:

# Accessibility.ZoomIn
source: zoom in up to 400% without the text spilling off the screen
cy: chwyddo i mewn hyd at 400% heb i’r testun ollwng oddi ar y sgrin

# Accessibility.PageTitle
source: Accessibility statement for ‘Report packaging data’
cy: Datganiad Hygyrchedd ar gyfer ‘Rhoi gwybod am ddata pecynwaith’

# Accessibility.ThereAreIssuesWithKeyboard
source: there are issues with keyboard navigation, heading structure and error messages when creating an account or signing in
cy: mae yna faterion ynglŷn â llywio â bysellfwrdd, strwythur y penawdau a negeseuon gwall wrth greu cyfrif neu fewngofnodi

# Accessibility.YoureAutomaticallySignedOut
source: you’re automatically signed out of the service after a period of inactivity without warning or explanation
cy: rydych chi’n cael eich allgofnodi’n awtomatig ar ôl cyfnod segur a hynny heb rybudd neu esboniad

# Accessibility.SomePageTitleMetaTags
source: some page title meta tags do not consistently describe the page content or match the page heading
cy: nid yw rhai o dagiau meta teitlau’r tudalennau yn disgrifio cynnwys y tudalen neu’n cyd-fynd â phennawd y tudalen

# Accessibility.NonAccessibleContent
source: Non-accessible content
cy: Cynnwys nad yw’n hygyrch

# Accessibility.TheContentListedBelow
source: The content listed below is non-accessible for the following reasons.
cy: Nid yw’r cynnwys isod yn hygyrch am y rhesymau a ganlyn.

# Accessibility.NonComplianceWithTheAccessibility
source: Non-compliance with the accessibility regulations
cy: Methu cydymffurfio â’r rheoliadau hygyrchedd

# Accessibility.WhenCreatingAnAccount
source: When creating an account or signing in to ‘report packaging data’:
cy: Wrth greu cyfrif neu fewngofnodi:

# Accessibility.ThereAreSomeUnnecessarySteps
source: there are some unnecessary steps in the keyboard navigation order - this fails WCAG 2.1 success criterion 2.4.3 (focus order)
cy: mae yna gamau diangen yn nhrefn llywio’r bysellfwrdd – mae hyn yn methu maen prawf llwyddiant 2.4.3 WCAG 2.1 (trefn y ffocws)

# Accessibility.EachTimeAPageLoads
source: each time a page loads, the focus is not at the top of the page - this fails WCAG 2.1 success criterion 2.4.3 (focus order)
cy: bob tro y mae tudalen yn llwytho, nid yw’r ffocws ar frig y tudalen – mae hyn yn methu maen prawf llwyddiant 2.4.3 WCAG 2.1 (trefn y ffocws)

# Accessibility.PageTitleMetaTags
source: page title meta tags do not consistently describe the page content or match the page heading - this fails WCAG 2.1 success criterion 2.4.2 (page titled)
cy: nid yw tagiau meta teitlau’r tudalennu yn gyson yn disgrifio cynnwys y tudalen neu’n cyd-fynd â phennawd y tudalen - mae hyn yn methu maen prawf llwyddiant 2.4.2 WCAG 2.1 (mae gan y tudalen deitl)

# Accessibility.SomeTextIsStyled
source: some text is styled as a heading but not marked up as a heading, so the sections may be difficult to understand or navigate using a screen reader - this fails WCAG 2.1 success criterion 1.3.1 (info and relationships)
cy: mae rhywfaint o’r testun yn arddull pennawd ond heb ei farcio fel pennawd, felly gall yr adrannau fod yn anodd eu deall neu eu llywio drwy ddefnyddio darllenydd sgrin - mae hyn yn methu maen prawf llwyddiant 1.3.1 WCAG 2.1 (gwybodaeth a pherthnasoedd)

# Accessibility.ErrorMessagesDoNotAccurately
source: error messages do not accurately explain the error that occurred - this fails WCAG 2.1 success criterion 3.3.3 (error suggestion)
cy: nid yw’r negeseuon gwall yn rhoi esboniad cywir o’r gwall sydd wedi digwydd - mae hyn yn methu maen prawf llwyddiant 3.3.3 WCAG 2.1 (awgrymu gwall)

# Accessibility.WhenYoureSignedOutAutomatically
source: When you’re signed out automatically after a period of inactivity, there is no warning. There is no option to extend or adjust the time period. This fails WCAG 2.1 success criterion 2.2.1 (timing adjustable). Also, the page shown after being signed out automatically does not explain what happened.
cy: Pan gewch chi eich allgofnodi ar ôl cyfnod segur, does dim rhybudd. Does dim opsiwn o ymestyn neu addasu’r cyfnod amser. Mae hyn yn methu maen prawf llwyddiant 2.2.1 WCAG 2.1 (gall yr amseru gael ei addasu). Hefyd, nid yw’r tudalen a ddangosir ar ôl ichi gael eich allgofnodi’n awtomatig yn esbonio beth ddigwyddodd.

# Accessibility.SomePageTitleMetaTagsThroughout
source: Some page title meta tags throughout the website do not consistently describe the page content or match the page heading. This fails WCAG 2.1 success criterion 2.4.2 (page titled).
cy: Nid yw rhai o dagiau meta teitlau’r tudalennau drwy’r wefan yn disgrifio cynnwys y tudalen neu’n cyd-fynd â phennawd y tudalen. Mae hyn yn methu maen prawf llwyddiant 2.4.2 WCAG 2.1 (mae gan y tudalen deitl).

# Accessibility.WereWorkingThroughTheseIssues
source: We’re working through these issues and intend to fix them by September 2024.
cy: Rydyn ni wrthi’n gweithio drwy’r materion hyn ac yn bwriadu eu cywiro erbyn mis Medi 2024.

# Accessibility.DueToTheNonCompliances
source: , due to the non-compliances listed below.
cy: , oherwydd y diffygion cydymffurfiaeth isod.
