Repository: DEFRA/epr-obligationchecker-frontend
Catalog: src/FrontendObligationChecker/Resources/Views/ObligationChecker/SingleQuestion.*.resx
Languages: cy

# question_option_no
source: No
cy: Nac ydyn

# question_option_yes
source: Yes
cy: Ydyn

# SingleQuestion.AnnualTurnover.AdditionalDescription1
source: Refer to your most recent annual accounts up until 7 April.
cy: Cyfeiriwch at eich cyfrifon blynyddol diweddaraf hyd at 7 Ebrill.

# SingleQuestion.AnnualTurnover.QuestionDescription
source: Your answer should include the reported turnover of all relevant subsidiaries in your group that supply (create, import, distribute or sell) packaging.
cy: Dylai'ch ateb gynnwys y trosiant sydd wedi'i adrodd ar gyfer pob is-gwmni perthnasol yn eich grŵp sy'n cyflenwi (creu, mewnforio, dosbarthu neu werthu) pecynwaith.

# SingleQuestion.AnnualTurnover.QuestionError
source: Select a turnover option.
cy: Dewiswch opsiwn trosiant.

# SingleQuestion.AnnualTurnover.QuestionOptionLabel1
source: Under £1 million
cy: O dan £1 miliwn

# SingleQuestion.AnnualTurnover.QuestionOptionLabel2
source: £1 million to £2 million
cy: £1 miliwn i £2 filiwn

# SingleQuestion.AnnualTurnover.QuestionOptionLabel3
source: £2 million or more
cy: £2 filiwn neu fwy

# SingleQuestion.AnnualTurnover.Title1
source: What was your group’s last annual turnover?
cy: Beth oedd trosiant eich grŵp yn yr adroddiad diwethaf?

# SingleQuestion.AnnualTurnover.Title2
source: What was your organisation’s last reported turnover?
cy: Beth oedd trosiant eich sefydliad yn yr adroddiad diwethaf?

# SingleQuestion.ContainerVolume.QuestionDescription
source: This includes containers between 150ml and 3l that are sold in multipacks.
cy: Mae hyn yn cynnwys cynwysyddion rhwng 150ml a 3l sy'n cael eu gwerthu mewn aml-becyn

# SingleQuestion.ContainerVolume.QuestionError
source: Select yes if any of the containers are between 150ml and 3l.
cy: Dewiswch Oes os oes unrhyw un neu ragor o'r cynwysyddion rhwng 150ml a 3l.

# SingleQuestion.ContainerVolume.Title
source: Are any of the containers between 150ml and 3l?
cy: Oes unrhyw un neu ragor o'r cynwysyddion rhwng 150ml a 3l?

# SingleQuestion.HiringLoaning.AlternateTitle
source: hiring or loaning out reusable packaging to UK organisations
cy: llogi neu fenthyca deunydd pacio y gellir ei ailddefnyddio i sefydliadau yn y DU

# SingleQuestion.HiringLoaning.PackagingHireLoanDescriptions
source: <p class="govuk-body">Some organisations hire or loan out reusable packaging, such as wooden pallets, to other organisations for transporting or protecting goods. The packaging is returned after use and loaned out again.</p>
cy: Mae rhai sefydliadau'n llogi neu'n rhoi benthyg pecynwaith a all gael ei ailddefnyddio, fel paledi pren, i sefydliadau eraill ar gyfer cludo neu ddiogelu nwyddau. Mae'r pecynwaith yn cael ei ddychwelyd ar ôl ei ddefnyddio ac yn cael ei roi ar fenthyg eto.

# SingleQuestion.HiringLoaning.QuestionError
source: Select yes if you hire or loan out reusable packaging to UK organisations.
cy: Dewiswch Ydyn os ydych chi'n llogi neu'n rhoi benthyg pecynwaith a all gael ei ailddefnyddio i sefydliadau yn y Deyrnas Unedig.

# SingleQuestion.HiringLoaning.Title
source: Do you hire or loan out reusable packaging to UK organisations?
cy: Ydych chi'n llogi neu'n rhoi benthyg pecynwaith a all gael ei ailddefnyddio i sefydliadau yn y Deyrnas Unedig?

# SingleQuestion.ImportingProducts.AlternateTitle
source: Do you import packaged goods to supply to the UK market?
cy: Ydych chi'n mewnforio nwyddau wedi'u pecynnu i'w cyflenwi i farchnad y Deyrnas Unedig?

# SingleQuestion.ImportingProducts.PackagingImportDescriptions
source: <p class="govuk-body">This also applies to you if you discard the packaging before supplying the goods.</p> <p class="govuk-body">Select no if you only import branded, filled packaging on behalf of a brand owner classed as a large organisation that is established in the UK.</p>
cy: <p class="govuk-body">Mae hyn yn gymwys i chi hefyd os ydych chi'n gwaredu'r pecynwaith cyn cyflenwi'r nwyddau.</p> <p class="govuk-body">Dewiswch Nac ydyn os ydych chi ond yn mewnforio pecynwaith wedi'i frandio, sydd wedi'i lenwi ar ran perchennog brand sy'n cael ei ystyried yn sefydliad mawr sydd wedi'i sefydlu yn y Deyrnas Unedig.</p>

# SingleQuestion.ImportingProducts.QuestionError
source: Select yes if you import packaged goods to supply to the UK market.
cy: Dewiswch Ydyn os ydych chi'n mewnforio nwyddau wedi'u pecynnu i'w cyflenwi i farchnad y Deyrnas Unedig.

# SingleQuestion.ImportingProducts.Title
source: Do you import packaged goods to supply to the UK market?
cy: Ydych chi'n mewnforio nwyddau wedi'u pecynnu i'w cyflenwi i farchnad y Deyrnas Unedig?

# SingleQuestion.MaterialsForDrinksContainers.AluminiumCans
source: Aluminium cans
cy: Caniau alwminiwm

# SingleQuestion.MaterialsForDrinksContainers.GlassBottles
source: Glass bottles
cy: Poteli gwydr

# SingleQuestion.MaterialsForDrinksContainers.None
source: None of the above
cy: Dim un o'r uchod

# SingleQuestion.MaterialsForDrinksContainers.PlasticBottles
source: Polyethylene terephthalate (PET) plastic bottles
cy: Poteli plastig polyethylen tereffthalat (PET)

# SingleQuestion.MaterialsForDrinksContainers.QuestionDescription
source: Select all that apply.
cy: Dewiswch bob un sy'n gymwys.

# SingleQuestion.MaterialsForDrinksContainers.QuestionError
source: Select one or more materials options.
cy: Dewiswch un neu ragor o'r opsiynau deunyddiau.

# SingleQuestion.MaterialsForDrinksContainers.QuestionTitle
source: Do you use any of the following materials for the drinks containers?
cy: Ydych chi'n defnyddio unrhyw un neu ragor o'r deunyddiau canlynol ar gyfer y cynwysyddion diodydd?

# SingleQuestion.MaterialsForDrinksContainers.SteelCans
source: Steel cans
cy: Caniau dur

# SingleQuestion.MaterialsForDrinksContainers.Title
source: Do you use any of the following materials for the drinks containers?
cy: Ydych chi'n defnyddio unrhyw un neu ragor o'r deunyddiau canlynol ar gyfer y cynwysyddion diodydd?

# SingleQuestion.OnlineMarketplace.AlternateTitle
source: Do you own an online marketplace allowing non-UK companies to sell packaged goods in the UK?
cy: Ydych chi'n berchen ar farchnad ar-lein sy'n caniatáu i gwmnïau o'r tu allan i'r Deyrnas Unedig werthu nwyddau sydd wedi'u pecynnu yn y Deyrnas Unedig?

# SingleQuestion.OnlineMarketplace.OnlineMarketplaceDescriptions
source: <p class="govuk-body">Under EPR for packaging, an online marketplace is a website or app that allows non-UK organisations to sell their goods in the UK.</p> <p class="govuk-body">If your organisation owns a website that sells goods from UK organisations only, this is not classed as an online marketplace.</p>
cy: <p class="govuk-body">O dan yr EPR dros becynwaith, mae marchnad ar-lein yn wefan neu ap sy'n caniatáu i sefydliadau y tu allan i'r Deyrnas Unedig werthu eu nwyddau yn y Deyrnas Unedig.</p> <p class="govuk-body">Os yw'ch sefydliad chi yn berchen ar wefan sy'n gwerthu nwyddau oddi wrth sefydliadau'r Deyrnas Unedig yn unig, nid yw hyn yn cael ei ystyried yn farchnad ar-lein.</p>

# SingleQuestion.OnlineMarketplace.QuestionError
source: Select yes if you own an online marketplace allowing non-UK companies to sell packaged goods in the UK.
cy: Dewiswch Ydyn os ydych chi'n berchen ar farchnad ar-lein sy'n caniatáu i gwmnïau o'r tu allan i'r Deyrnas Unedig werthu.

# SingleQuestion.OnlineMarketplace.Title
source: Do you own an online marketplace allowing non-UK companies to sell packaged goods in the UK?
cy: Ydych chi'n berchen ar farchnad ar-lein sy'n caniatáu i gwmnïau o'r tu allan i'r Deyrnas Unedig werthu nwyddau sydd wedi'u pecynnu yn y Deyrnas Unedig?

# SingleQuestion.OwnBrand.AnotherOrganisationTasks
source: <p class="govuk-body">You supply goods under your own brand even if you pay or license another company to:</p> <ul class="govuk-list govuk-list--bullet"> <li>produce goods that will be supplied under your brand name</li> <li>pack goods that will be supplied under your brand name</li> <li>supply your branded goods in the UK</li> <li>import branded packaged goods for you</li> </ul>
cy: <p class="govuk-body">Rydych chi'n cyflenwi nwyddau o dan eich brand eich hun hyd yn oed os ydych chi'n talu neu'n trwyddedu cwmni arall i wneud y canlynol:</p> <ul class="govuk-list govuk-list--bullet"> <li>cynhyrchu nwyddau a fydd yn cael eu cyflenwi o dan eich enw brand chi</li> <li>pecynnu nwyddau a fydd yn cael eu cyflenwi o dan eich enw brand chi</li> <li>cyflenwi'ch nwyddau wedi'u brandio yn y Deyrnas Unedig</li> <li>mewnforio nwyddau wedi'u brandio sydd wedi'u pecynnu ar eich rhan</li> </ul>

# SingleQuestion.OwnBrand.BrandDescriptions
source: <p class="govuk-body">A brand is something your business could be visibly identified by, including:</p> <ul class="govuk-list govuk-list--bullet"> <li>a name</li> <li>a trademark</li> <li>any distinctive mark</li> </ul>
cy: <p class="govuk-body">Mae brand yn rhywbeth y gallai'ch busnes gael ei adnabod yn amlwg yn ei sgil, gan gynnwys:</p> <ul class="govuk-list govuk-list--bullet"> <li>enw</li> <li>nod masnach</li> <li>unrhyw farc unigryw</li> </ul>

# SingleQuestion.OwnBrand.QuestionError
source: Select yes if you supply goods to the UK market under your own brand.
cy: Dewiswch Ydyn os ydych chi'n cyflenwi nwyddau i farchnad y Deyrnas Unedig o dan eich brand eich hun.

# SingleQuestion.OwnBrand.Title
source: Do you supply goods to the UK market under your own brand?
cy: Ydych chi'n cyflenwi nwyddau i farchnad y Deyrnas Unedig o dan eich brand eich hun?

# SingleQuestion.PlaceDrinksOnMarket.Title
source: Do you supply drinks in single-use containers in the UK?
cy: Ydych chi'n cyflenwi diodydd mewn cynwysyddion untro yn y Deyrnas Unedig?

# SingleQuestion.SellingEmptyPackaging.AlternateTitle
source: Supplying empty packaging to businesses that fall under the higher threshold
cy: Cyflenwi deunydd pacio gwag i fusnesau sy'n dod o dan y trothwy uwch

# SingleQuestion.SellingEmptyPackaging.HigherThresholdDescriptions
source: <p class="govuk-body">Select yes if you supply to:</p> <p class="govuk-body"></p> <ul class="govuk-list govuk-list--bullet"> <li>large organisations which do not pack or fill the packaging, or are brand owners of the packaging</li> <li>small organisations</li> <li> organisations below the small producer threshold</li> </ul> <p class="govuk-body"> <a href="https://www.gov.uk/guidance/packaging-waste-prepare-for-extended-producer-responsibility#what-you-may-need-to-do" class="govuk-link" target="_blank">Read more about classifications and thresholds</a></p>
cy: <p class="govuk-body">Dewiswch Ydyn os ydych chi'n cyflenwi:</p> <p class="govuk-body"></p> <ul class="govuk-list govuk-list--bullet"> <li>sefydliadau mawr nad ydyn nhw'n pacio neu'n llenwi'r pecynwaith, neu sy'n berchnogion brand y pecynwaith</li> <li>sefydliadau bach</li> <li> sefydliadau o dan y trothwy cynhyrchwyr bach</li> </ul> <p class="govuk-body"> <a href="https://www.gov.uk/guidance/packaging-waste-prepare-for-extended-producer-responsibility#what-you-may-need-to-do" class="govuk-link" target="_blank">Darllenwch ragor am ddosbarthiadau a throthwyon</a></p>

# SingleQuestion.SellingEmptyPackaging.QuestionError
source: Select yes if you supply empty packaging you've imported or manufactured.
cy: Dewiswch Ydyn os ydych chi'n cyflenwi pecynwaith gwag rydych chi wedi'i fewnforio neu wedi'i weithgynhyrchu.

# SingleQuestion.SellingEmptyPackaging.Title
source: Do you supply empty packaging you've imported or manufactured?
cy: Ydych chi'n cyflenwi pecynwaith gwag rydych chi wedi'i fewnforio neu wedi'i weithgynhyrchu?

# SingleQuestion.SupplyingFilledPackaging.AlternateTitle
source: Do you supply filled packaging to end users?
cy: Ydych chi'n cyflenwi pecynwaith wedi'i lenwi i ddefnyddwyr terfynol?

# SingleQuestion.SupplyingFilledPackaging.SupplierConsumerDescriptions
source: <p class="govuk-body">An end user is the last person to use packaging before discarding it. This could be a consumer or a business.</p>
cy: Defnyddiwr terfynol yw'r person olaf i ddefnyddio pecynwaith cyn ei waredu. Gallai hyn fod yn ddefnyddiwr unigol neu'n fusnes.

# SingleQuestion.SupplyingFilledPackaging.Title
source: Do you supply filled packaging to end users?
cy: Ydych chi'n cyflenwi pecynwaith wedi'i lenwi i ddefnyddwyr terfynol?

# SingleQuestion.TypeOfOrganisation.Detail
source: <p class="govuk-body">There are different ways you can comply with EPR for packaging.</p> <p class="govuk-body">You can register as: </p> <ul class="govuk-list govuk-list--bullet"> <li>a whole group (in this instance, the parent group complies with EPR for packaging on behalf of every subsidiary within the group)</li> <li>individual subsidiaries (in this instance, the subsidiaries that meet the turnover and tonnage requirements comply with EPR for packaging independently)</li> <li>a parent company for part of the group (this is where the parent company registers to comply with EPR for packaging on behalf of some, but not all of its subsidiaries)</li> </ul> <p class="govuk-body"> <a href="https://www.gov.uk/guidance/extended-producer-responsibility-for-packaging-who-is-affected-and-what-to-do#if-youre-a-parent-company-group-or-subsidiary" class="govuk-link" target="_blank"> Check which type of organisation you should select </a> </p>
cy: <p class="govuk-body">Mae yna wahanol ffyrdd y gallwch chi gydymffurfio â'r EPR dros becynwaith.</p> <p class="govuk-body">Gallwch gofrestru fel: </p> <ul class="govuk-list govuk-list--bullet"> <li> grŵp cyfan (yn yr achos hwn, mae'r rhiant-grŵp yn cydymffurfio â'r EPR dros becynwaith ar ran pob is-gwmni yn y grŵp)</li> <li> is-gwmnïau unigol (yn yr achos hwn, mae'r is-gwmnïau sy'n bodloni'r gofynion ynglŷn â throsiant a thunelledd yn cydymffurfio â'r EPR dros becynwaith yn annibynnol)</li> <li> rhiant-gwmni ar gyfer rhan o'r grŵp (sef lle mae'r rhiant-gwmni yn cofrestru i gydymffurfio â'r EPR dros becynwaith ar ran rhai o'i is-gwmnïau ond nid pob un)</li> </ul> <p class="govuk-body"> <a href="https://www.gov.uk/guidance/extended-producer-responsibility-for-packaging-who-is-affected-and-what-to-do#if-youre-a-parent-company-group-or-subsidiary" class="govuk-link" target="_blank"> Gwiriwch pa fath o sefydliad y dylech ei ddewis </a> </p>

# SingleQuestion.TypeOfOrganisation.QuestionDescription
source: Parent companies (sometimes called a holding company) own groups. Subsidiaries are the separate organisations that form a group. You’re a parent company if your business owns any subsidiaries. This includes any subsidiaries registered outside of the UK.
cy: Mae rhiant-gwmnïau (sydd weithiau'n cael eu galw'n gwmnïau daliannol) yn berchen ar grwpiau. Is-gwmnïau yw'r sefydliadau gwahanol sy'n ffurfio grŵp. Rydych chi'n rhiant-gwmni os yw'ch busnes yn berchen ar unrhyw is-gwmnïau. Mae hyn yn cynnwys unrhyw is-gwmnïau sydd wedi'u cofrestru y tu allan i'r Deyrnas Unedig.

# SingleQuestion.TypeOfOrganisation.QuestionError
source: Select an organisation type.
cy: Dewiswch fath o sefydliad.

# SingleQuestion.TypeOfOrganisation.QuestionOptionLabel1
source: Parent company
cy: Rhiant-gwmni

# SingleQuestion.TypeOfOrganisation.QuestionOptionLabel2
source: Subsidiary
cy: Is-gwmni

# SingleQuestion.TypeOfOrganisation.QuestionOptionLabel3
source: Individual company
cy: Cwmni unigol

# SingleQuestion.TypeOfOrganisation.Summary
source: How EPR for packaging affects parent companies and subsidiaries
cy: Sut mae'r EPR dros becynwaith yn effeithio ar riant-gwmnïau ac is-gwmnïau

# SingleQuestion.TypeOfOrganisation.Title
source: What type of organisation are you?
cy: Pa fath o sefydliad ydych chi?

# SingleQuestion.UnbrandedPackaging.AlternateTitle
source: Do you place goods into packaging?
cy: Ydych chi'n gosod nwyddau mewn pecynwaith

# SingleQuestion.UnbrandedPackaging.PlacingGoodsDescriptions
source: <p class="govuk-body">This could be goods you packaged for your own organisation or for another organisation.</p> <p class="govuk-body">Select no if you only pack goods which another large organisation is responsible for. </p> <p class="govuk-body"> <a href="https://www.gov.uk/guidance/extended-producer-responsibility-for-packaging-who-is-affected-and-what-to-do#packaging-activities" target="_blank" > Learn more about responsibilities </a> </p>
cy: <p class="govuk-body">Gallai hyn fod yn nwyddau rydych chi'n eu pecynnu i'ch sefydliad eich hun neu ar ran sefydliad arall.</p> <p class="govuk-body"> </p> <p class="govuk-body">Dewiswch Nac ydyn os ydych chi ond yn pacio nwyddau y mae sefydliad mawr arall yn gyfrifol amdanyn nhw. </p> <p class="govuk-body"> <a href="https://www.gov.uk/guidance/extended-producer-responsibility-for-packaging-who-is-affected-and-what-to-do#packaging-activities" target="_blank" > Rhagor o wybodaeth am gyfrifoldebau. </a> </p>

# SingleQuestion.UnbrandedPackaging.Title
source: Do you place goods into packaging?
cy: Ydych chi'n gosod nwyddau mewn pecynwaith
